app/controllers/locations_controller.rb

  def update
    if @location.update(location_params)
---
UPDATE "locations" SET "title" = $1, "longitude" = $2, "updated_at" = $3 WHERE "locations"."id" = $4  [["title", "This is a different title"], ["longitude", -87.62255139999999], ["updated_at", 2017-03-29 20:38:38 UTC], ["id", 5]]

  def set_location
    @location = Location.find(params[:id])
---
SELECT locations.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((48.85837009999999 - locations.latitude) * PI() / 180 / 2), 2) + COS(48.85837009999999 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((2.2944813 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - 2.2944813) / 57.2957795), ((locations.latitude - 48.85837009999999) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 48.56890653377829 AND 49.147833666221686 AND locations.longitude BETWEEN 1.854515309725329 AND 2.7344472902746713 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((48.85837009999999 - locations.latitude) * PI() / 180 / 2), 2) + COS(48.85837009999999 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((2.2944813 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 20) ORDER BY distance ASC